spec/spec/SVAP/AcquiringApplications/Examples/app_flow.example.2003.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://bpc.ru/sv/SVAP">
<soapenv:Header/>
<soapenv:Body>
	<application xmlns="http://sv.bpc.in/SVAP" id="application_1">
	<application_type>APTPACQA</application_type>                                      		<!-- Application type - Acquiring -->
	<application_flow_id>2003</application_flow_id>                                      	<!-- Application flow (business process) - Add new merchant -->
	<application_status>APST0006</application_status>                                       <!-- Application status - Ready to process -->
	<operator_id>ADMIN</operator_id>                                      					<!-- User name who made this application -->
	<institution_id>1001</institution_id>                                      				<!-- Institution identifier -->
	<agent_id>10000001</agent_id>                                      						<!-- Agent identifier -->
	<customer_type>ENTTCOMP</customer_type>
	<customer id="customer_1">
		<command>CMMDEXPR</command>                                      					<!-- Command for customer - find existing customer -->
		<customer_number>0000000000000000000697</customer_number>                           <!-- Unique customer number -->
		<contract id="contract_1">
			<command>CMMDEXPR</command>                                      				<!-- Command for contract - find existing contract -->
			<contract_type>CNTPMRCB</contract_type>
			<product_id>1</product_id>
			<contract_number>00000000000000000000000000000736</contract_number>             <!-- Contract number -->
			<merchant id="merchant_1">
				<command>CMMDCREX</command>                                      			<!-- Create new merchant -->
				<merchant_name>Auto_Merchant</merchant_name>                                <!-- Merchant system name -->
				<merchant_label language="LANGENG">Food n Drinks West</merchant_label>      <!-- Merchant official name -->
				<merchant_type>MRCTBANK</merchant_type>                                     <!-- Subordinate merchant type -->
				<mcc>6536</mcc>                                      						<!-- Merchant Category Code -->
				<contact id="contact_1">                                      				<!-- Contact -->
					<command>CMMDCRUP</command>                                      		<!-- Command for contact - Create new or update if exists -->
					<contact_type>CNTTPRMC</contact_type>                                   <!-- Contact type - Primary -->
					<preferred_lang>LANGENG</preferred_lang>                                <!-- Preferred language of speaking -->
					<contact_data id="contact_data_1">
						<commun_method>CMNM0001</commun_method>                             <!-- Communication method - Mobile phone -->
						<commun_address>10000045476</commun_address>                        <!-- Communication address - Mobile phone number -->
					</contact_data>
				</contact>
				<address id="address_1">                                      				<!-- Address -->
					<command>CMMDCRUP</command>                                      		<!-- Command for address - Create new or update if exists -->
					<address_type>ADTPBSNA</address_type>                                   <!-- Address type - Home address -->
					<country>643</country>                                      			<!-- Country ISO code - Russia -->
 
					<address_name language="LANGENG" id="address_name_1">                   <!-- Address. Attribute LANGUAGE contain code of language of provided address - English -->
						<region>Moscow</region>                                      		<!-- Region name -->
						<city>Moscow</city>                                      			<!-- Name of city -->
						<street>Street 2</street>                                      		<!-- Street -->
					</address_name>
					<house>56</house>                                      					<!-- House number -->
					<apartment>34</apartment>                                      			<!-- Office number -->
					<postal_code>123456</postal_code>
				</address>
			</merchant>

			<service value="70000072">                                      				<!-- define servicing terms for merchant -->
				<service_object  ref_id="merchant_1">                                      	<!-- Reference to merchant element -->
					<start_date>2015-01-13</start_date>                                     <!-- Servicing start date -->
				</service_object>
			</service>
		</contract>
	</customer>
</application>
</soapenv:Body>
</soapenv:Envelope>
